import styles from "./page.module.scss";
import QuestionIcon from "@/src/images/question-icon.svg";
import Header from "@/src/components/Organisms/Header/Header";

const Question = () => {
    return (
        <div className={styles.question}>
            <Header
                name=""
                title="Спасибо за вопрос!"
                ImageHeader={QuestionIcon}
            />
            <section className={styles.question__container}>
                <div className={styles.question__wrap}>
                    <h2 className={styles.question__title}>
                        Мы получили Ваш вопрос и ответим
                        <br />
                        на него в ближайшее время:
                    </h2>
                    <div className={styles.question__textWrap}>
                        <div className={styles.question__svg}>
                            <svg
                                xmlns="http://www.w3.org/2000/svg"
                                width="25"
                                height="21"
                                viewBox="0 0 25 21"
                                fill="none"
                            >
                                <path
                                    d="M13.6 12.8C13.6 8.69333 14.56 5.54667 16.48 3.36C18.4533 1.12 21.0933 0 24.4 0V4C22.8 4 21.52 4.45333 20.56 5.36C19.6533 6.21333 19.2 7.36 19.2 8.8V9.6C19.2 9.70667 19.2267 9.78667 19.28 9.84C19.44 9.84 19.6 9.81333 19.76 9.76C20.1867 9.65333 20.5333 9.6 20.8 9.6C21.8667 9.6 22.8 10.08 23.6 11.04C24.4 12 24.8 13.2533 24.8 14.8C24.8 16.4 24.2667 17.7333 23.2 18.8C22.1867 19.8667 20.9067 20.4 19.36 20.4C17.6 20.4 16.1867 19.76 15.12 18.48C14.1067 17.2 13.6 15.3067 13.6 12.8ZM0 12.8C0 8.69333 0.96 5.54667 2.88 3.36C4.85333 1.12 7.49333 0 10.8 0V4C9.2 4 7.92 4.45333 6.96 5.36C6.05333 6.21333 5.6 7.36 5.6 8.8V9.6C5.6 9.70667 5.62667 9.78667 5.68 9.84C5.84 9.84 6 9.81333 6.16 9.76C6.58667 9.65333 6.93333 9.6 7.2 9.6C8.26667 9.6 9.2 10.08 10 11.04C10.8 12 11.2 13.2533 11.2 14.8C11.2 16.4 10.6667 17.7333 9.6 18.8C8.58667 19.8667 7.30667 20.4 5.76 20.4C4 20.4 2.58667 19.76 1.52 18.48C0.506667 17.2 0 15.3067 0 12.8Z"
                                    fill="#D7B27B"
                                />
                            </svg>
                        </div>
                        <p className={styles.question__text}>
                            Далеко-далеко за словесными горами в стране гласных
                            и согласных живут рыбные тексты. Вдали от всех живут
                            они в буквенных домах на берегу Семантика большого
                            языкового океана. Маленький ручеек Даль журчит по
                            всей стране и обеспечивает ее всеми необходимыми
                            правилами. Эта парадигматическая страна, в которой
                            жаренные члены предложения залетают прямо в рот.{" "}
                        </p>
                    </div>
                </div>
            </section>
        </div>
    );
};

export default Question;
